wrk2/results/no_istio_20251230_154433/wrk_logs/wrk_1000rps_rep2.log
Running 1m test @ http://192.168.49.2:30918
  4 threads and 100 connections

  Thread calibration: mean lat.: 1735.937ms, rate sampling interval: 6901ms
  Thread calibration: mean lat.: 1554.044ms, rate sampling interval: 6782ms
  Thread calibration: mean lat.: 1818.920ms, rate sampling interval: 7368ms
  Thread calibration: mean lat.: 1729.976ms, rate sampling interval: 7409ms

-----------------------------------------------------------------------
Test Results @ http://192.168.49.2:30918 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    12.58s     6.22s   25.99s    61.63%
    Req/Sec   152.23     14.05   188.00     73.08%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.93s 
 75.000%   17.43s 
 90.000%   21.54s 
 99.000%   25.99s 
 99.900%   28.13s 
 99.990%   29.34s 
 99.999%   29.72s 
100.000%   29.72s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       8.163     0.000000            1         1.00
    4915.199     0.100000         3041         1.11
    6582.271     0.200000         6076         1.25
    8114.175     0.300000         9110         1.43
    9920.511     0.400000        12154         1.67
   11927.551     0.500000        15184         2.00
   13033.471     0.550000        16701         2.22
   14024.703     0.600000        18226         2.50
   15073.279     0.650000        19741         2.86
   16252.927     0.700000        21260         3.33
   17432.575     0.750000        22773         4.00
   18071.551     0.775000        23541         4.44
   18776.063     0.800000        24297         5.00
   19316.735     0.825000        25054         5.71
   19890.175     0.850000        25811         6.67
   20660.223     0.875000        26574         8.00
   21102.591     0.887500        26952         8.89
   21544.959     0.900000        27326        10.00
   22036.479     0.912500        27702        11.43
   22429.695     0.925000        28096        13.33
   22921.215     0.937500        28473        16.00
   23150.591     0.943750        28653        17.78
   23412.735     0.950000        28849        20.00
   23658.495     0.956250        29036        22.86
   23920.639     0.962500        29226        26.67
   24248.319     0.968750        29411        32.00
   24412.159     0.971875        29506        35.56
   24592.383     0.975000        29602        40.00
   24805.375     0.978125        29694        45.71
   25083.903     0.981250        29793        53.33
   25329.663     0.984375        29884        64.00
   25460.735     0.985938        29932        71.11
   25657.343     0.987500        29982        80.00
   25821.183     0.989062        30027        91.43
   26050.559     0.990625        30074       106.67
   26312.703     0.992188        30126       128.00
   26427.391     0.992969        30146       142.22
   26574.847     0.993750        30172       160.00
   26673.151     0.994531        30193       182.86
   26869.759     0.995313        30217       213.33
   27049.983     0.996094        30244       256.00
   27131.903     0.996484        30253       284.44
   27197.439     0.996875        30264       320.00
   27246.591     0.997266        30275       365.71
   27377.663     0.997656        30287       426.67
   27525.119     0.998047        30300       512.00
   27574.271     0.998242        30305       568.89
   27672.575     0.998437        30312       640.00
   27770.879     0.998633        30319       731.43
   27820.031     0.998828        30323       853.33
   28147.711     0.999023        30330      1024.00
   28180.479     0.999121        30332      1137.78
   28229.631     0.999219        30336      1280.00
   28262.399     0.999316        30338      1462.86
   28311.551     0.999414        30341      1706.67
   28393.471     0.999512        30344      2048.00
   28426.239     0.999561        30346      2275.56
   28442.623     0.999609        30347      2560.00
   28704.767     0.999658        30349      2925.71
   28753.919     0.999707        30350      3413.33
   28770.303     0.999756        30352      4096.00
   28770.303     0.999780        30352      4551.11
   28803.071     0.999805        30353      5120.00
   28803.071     0.999829        30353      5851.43
   28868.607     0.999854        30354      6826.67
   29343.743     0.999878        30355      8192.00
   29343.743     0.999890        30355      9102.22
   29425.663     0.999902        30356     10240.00
   29425.663     0.999915        30356     11702.86
   29425.663     0.999927        30356     13653.33
   29687.807     0.999939        30357     16384.00
   29687.807     0.999945        30357     18204.44
   29687.807     0.999951        30357     20480.00
   29687.807     0.999957        30357     23405.71
   29687.807     0.999963        30357     27306.67
   29720.575     0.999969        30358     32768.00
   29720.575     1.000000        30358          inf
#[Mean    =    12575.446, StdDeviation   =     6224.285]
#[Max     =    29704.192, Total count    =        30358]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  36472 requests in 1.00m, 12.34MB read
  Non-2xx or 3xx responses: 1218
Requests/sec:    607.53  
Transfer/sec:    210.54KB