wrk2/results/no_istio_20251230_154433/wrk_logs/wrk_1000rps_rep3.log
Running 1m test @ http://192.168.49.2:30918
  4 threads and 100 connections

  Thread calibration: mean lat.: 1614.058ms, rate sampling interval: 6565ms
  Thread calibration: mean lat.: 1939.983ms, rate sampling interval: 8421ms
  Thread calibration: mean lat.: 1941.824ms, rate sampling interval: 7745ms
  Thread calibration: mean lat.: 1985.919ms, rate sampling interval: 7856ms

-----------------------------------------------------------------------
Test Results @ http://192.168.49.2:30918 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    14.37s     6.53s   29.39s    62.81%
    Req/Sec   143.12      8.78   173.00     87.50%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   14.18s 
 75.000%   19.35s 
 90.000%   22.94s 
 99.000%   29.39s 
 99.900%   32.29s 
 99.990%   32.72s 
 99.999%   33.33s 
100.000%   33.33s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     553.471     0.000000            1         1.00
    5644.287     0.100000         2884         1.11
    8069.119     0.200000         5767         1.25
   10223.615     0.300000         8662         1.43
   12050.431     0.400000        11541         1.67
   14180.351     0.500000        14418         2.00
   15409.151     0.550000        15863         2.22
   16433.151     0.600000        17309         2.50
   17367.039     0.650000        18760         2.86
   18300.927     0.700000        20189         3.33
   19349.503     0.750000        21631         4.00
   19873.791     0.775000        22357         4.44
   20447.231     0.800000        23081         5.00
   21053.439     0.825000        23792         5.71
   21610.495     0.850000        24509         6.67
   22200.319     0.875000        25236         8.00
   22560.767     0.887500        25597         8.89
   22937.599     0.900000        25958        10.00
   23363.583     0.912500        26319        11.43
   23773.183     0.925000        26675        13.33
   24428.543     0.937500        27034        16.00
   24838.143     0.943750        27215        17.78
   25214.975     0.950000        27397        20.00
   25591.807     0.956250        27574        22.86
   25952.255     0.962500        27758        26.67
   26394.623     0.968750        27936        32.00
   26591.231     0.971875        28031        35.56
   26787.839     0.975000        28117        40.00
   26968.063     0.978125        28204        45.71
   27295.743     0.981250        28297        53.33
   27934.719     0.984375        28386        64.00
   28295.167     0.985938        28429        71.11
   28803.071     0.987500        28476        80.00
   29147.135     0.989062        28520        91.43
   29491.199     0.990625        28564       106.67
   29884.415     0.992188        28611       128.00
   30228.479     0.992969        28632       142.22
   30588.927     0.993750        28654       160.00
   30998.527     0.994531        28677       182.86
   31326.207     0.995313        28700       213.33
   31506.431     0.996094        28723       256.00
   31571.967     0.996484        28735       284.44
   31670.271     0.996875        28746       320.00
   31735.807     0.997266        28757       365.71
   31817.727     0.997656        28768       426.67
   31981.567     0.998047        28778       512.00
   32079.871     0.998242        28785       568.89
   32129.023     0.998437        28790       640.00
   32178.175     0.998633        28795       731.43
   32243.711     0.998828        28802       853.33
   32309.247     0.999023        28811      1024.00
   32309.247     0.999121        28811      1137.78
   32325.631     0.999219        28814      1280.00
   32423.935     0.999316        28815      1462.86
   32505.855     0.999414        28818      1706.67
   32522.239     0.999512        28822      2048.00
   32522.239     0.999561        28822      2275.56
   32555.007     0.999609        28823      2560.00
   32571.391     0.999658        28825      2925.71
   32587.775     0.999707        28826      3413.33
   32604.159     0.999756        28827      4096.00
   32669.695     0.999780        28828      4551.11
   32702.463     0.999805        28830      5120.00
   32702.463     0.999829        28830      5851.43
   32702.463     0.999854        28830      6826.67
   32718.847     0.999878        28831      8192.00
   32718.847     0.999890        28831      9102.22
   32751.615     0.999902        28832     10240.00
   32751.615     0.999915        28832     11702.86
   32751.615     0.999927        28832     13653.33
   32899.071     0.999939        28833     16384.00
   32899.071     0.999945        28833     18204.44
   32899.071     0.999951        28833     20480.00
   32899.071     0.999957        28833     23405.71
   32899.071     0.999963        28833     27306.67
   33325.055     0.999969        28834     32768.00
   33325.055     1.000000        28834          inf
#[Mean    =    14372.288, StdDeviation   =     6532.884]
#[Max     =    33308.672, Total count    =        28834]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  34436 requests in 1.00m, 11.46MB read
Requests/sec:    573.90  
Transfer/sec:    195.52KB