wrk2/results/no_istio_20251230_154433/wrk_logs/wrk_200rps_rep1.log
Running 1m test @ http://192.168.49.2:30918
  4 threads and 100 connections

  Thread calibration: mean lat.: 72.286ms, rate sampling interval: 476ms
  Thread calibration: mean lat.: 72.857ms, rate sampling interval: 481ms
  Thread calibration: mean lat.: 82.373ms, rate sampling interval: 547ms
  Thread calibration: mean lat.: 77.016ms, rate sampling interval: 458ms

-----------------------------------------------------------------------
Test Results @ http://192.168.49.2:30918 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    80.81ms  121.93ms 476.67ms   84.29%
    Req/Sec    49.09     10.36    72.00     70.52%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.29ms
 75.000%  131.58ms
 90.000%  266.24ms
 99.000%  476.67ms
 99.900%  713.22ms
 99.990%  857.09ms
 99.999%  922.11ms
100.000%  922.11ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.753     0.000000            1         1.00
       2.004     0.100000          993         1.11
       2.325     0.200000         1986         1.25
       2.861     0.300000         2974         1.43
       4.211     0.400000         3967         1.67
       5.291     0.500000         4955         2.00
       6.175     0.550000         5451         2.22
      11.543     0.600000         5945         2.50
      86.719     0.650000         6440         2.86
     104.127     0.700000         6937         3.33
     131.583     0.750000         7430         4.00
     148.863     0.775000         7678         4.44
     166.527     0.800000         7925         5.00
     186.239     0.825000         8173         5.71
     209.535     0.850000         8421         6.67
     234.879     0.875000         8668         8.00
     250.367     0.887500         8793         8.89
     266.239     0.900000         8917        10.00
     285.439     0.912500         9040        11.43
     303.359     0.925000         9164        13.33
     323.327     0.937500         9288        16.00
     332.287     0.943750         9349        17.78
     344.319     0.950000         9411        20.00
     358.911     0.956250         9474        22.86
     372.991     0.962500         9537        26.67
     393.471     0.968750         9597        32.00
     404.479     0.971875         9628        35.56
     415.231     0.975000         9659        40.00
     427.007     0.978125         9690        45.71
     436.479     0.981250         9721        53.33
     453.119     0.984375         9752        64.00
     459.519     0.985938         9767        71.11
     465.663     0.987500         9783        80.00
     472.063     0.989062         9799        91.43
     480.511     0.990625         9814       106.67
     494.591     0.992188         9829       128.00
     509.695     0.992969         9837       142.22
     516.351     0.993750         9845       160.00
     528.895     0.994531         9852       182.86
     538.111     0.995313         9860       213.33
     547.839     0.996094         9868       256.00
     559.103     0.996484         9872       284.44
     579.583     0.996875         9876       320.00
     590.847     0.997266         9879       365.71
     594.431     0.997656         9883       426.67
     609.791     0.998047         9887       512.00
     620.543     0.998242         9889       568.89
     645.119     0.998437         9891       640.00
     665.087     0.998633         9893       731.43
     700.927     0.998828         9895       853.33
     736.767     0.999023         9897      1024.00
     741.887     0.999121         9898      1137.78
     754.175     0.999219         9899      1280.00
     762.879     0.999316         9900      1462.86
     771.071     0.999414         9901      1706.67
     775.167     0.999512         9902      2048.00
     775.167     0.999561         9902      2275.56
     776.703     0.999609         9903      2560.00
     776.703     0.999658         9903      2925.71
     781.823     0.999707         9904      3413.33
     781.823     0.999756         9904      4096.00
     781.823     0.999780         9904      4551.11
     857.087     0.999805         9905      5120.00
     857.087     0.999829         9905      5851.43
     857.087     0.999854         9905      6826.67
     857.087     0.999878         9905      8192.00
     857.087     0.999890         9905      9102.22
     922.111     0.999902         9906     10240.00
     922.111     1.000000         9906          inf
#[Mean    =       80.808, StdDeviation   =      121.931]
#[Max     =      921.600, Total count    =         9906]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  11853 requests in 1.00m, 3.90MB read
  Socket errors: connect 0, read 0, write 0, timeout 56
Requests/sec:    197.55  
Transfer/sec:     66.61KB